# # поиск и подсчет символов в строке
# straka="привет как дела"
# a=0
# k=input()
# for i in straka:
#     if i == k: a +=1
# print(a)

# a=123456
# ss= a - ((a//60)*60)
# mm= a//60 - ((a//60//60)*60)
# hh= a//60//60 -((a//60//60//24)*24)
# dd= a //60//60//24 -((a//60//60//24//365)*365)


# print(f"{dd}дней {hh}:{mm}:{ss}")

# Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.

#  Пример:


# Для N = 5: 1, -3, 9, -27, 81
a=int(input())
for i in range(1,a+1) :
    print((-3)**i)



# for i in range(5):
#     print((-3) ** i, end=" ")
